app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    event = Event.all