app/controllers/events_controller.rb

INSERT INTO "events" ("title", "description", "start_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hhh"], ["description", nil], ["start_at", nil], ["created_at", "2023-01-15 17:44:12.605728"], ["updated_at", "2023-01-15 17:44:12.605728"]]
---
  def create
    event = current_user.events.create(event_params)